In [2]:
import pandas as pd
import numpy as np

In [7]:
df = pd.read_csv('../../kaggle_HomeCredit/home-credit-default-risk/application_train.csv')
cre = pd.read_csv('../../kaggle_HomeCredit/home-credit-default-risk/credit_card_balance.csv')

### １問

In [4]:
a1 = df.query('OWN_CAR_AGE != "NaN"')
print(len(a1))
a1.head()

104582

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
6,100009,0,Cash loans,F,Y,Y,1,171000.0,1560726.0,41301.0,...,0,0,0,0,0.0,0.0,0.0,1.0,1.0,2.0
7,100010,0,Cash loans,M,Y,Y,0,360000.0,1530000.0,42075.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
13,100017,0,Cash loans,M,Y,N,1,225000.0,918468.0,28966.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
15,100019,0,Cash loans,M,Y,Y,0,157500.0,299772.0,20160.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0

### ２問

In [5]:
len(pd.merge(df, cre, on='SK_ID_CURR' , how='inner').groupby('SK_ID_CURR'))

86905

### ３問

In [6]:
df_3 = df.copy()
df_3.loc[df_3['CODE_GENDER']=='F', 'CODE_GENDER'] = 0
df_3.loc[df_3['CODE_GENDER']=='M', 'CODE_GENDER'] = 1
df_3.loc[df_3['CODE_GENDER']=='XNA', 'CODE_GENDER'] = 2

In [7]:
df['CODE_GENDER'].head()

0    M
1    F
2    M
3    F
4    M
Name: CODE_GENDER, dtype: object

### 4問

In [8]:
df[['AMT_INCOME_TOTAL', 'REGION_POPULATION_RELATIVE']].apply(lambda x: x.max())

AMT_INCOME_TOTAL              1.170000e+08
REGION_POPULATION_RELATIVE    7.250800e-02
dtype: float64

### 5問

In [9]:
from statistics import mean

f1 = lambda x: mean(x) if x.name == 'AMT_INCOME_TOTAL' else x.min()
df[['AMT_INCOME_TOTAL', 'REGION_POPULATION_RELATIVE']].apply(f1)

AMT_INCOME_TOTAL              168797.919297
REGION_POPULATION_RELATIVE         0.000290
dtype: float64

### 6問

In [10]:
#for文
numerical_col =[]
not_numerical_col = []
for col in df:
    if df[col].dtype == 'object':
        not_numerical_col.append(col)
    else:
        numerical_col.append(col)

print('numerical list: ', len(numerical_col))
print('not numerical list: ', len(not_numerical_col))

numerical list:  106
not numerical list:  16

In [11]:
#ワンライナー
numerical_col2 =[]
not_numerical_col2 = []
f2 = lambda x: not_numerical_col2.append(x.name) if df[x.name].dtype == 'object' else numerical_col2.append(x.name)

df.apply(f2)
print('numerical list: ', len(numerical_col2))
print('not numerical list: ', len(not_numerical_col2))

numerical list:  106
not numerical list:  16

### 7問

In [3]:
bureau = pd.read_csv('../../kaggle_HomeCredit/home-credit-default-risk/bureau.csv')

In [55]:
curr_162297 = bureau[bureau['SK_ID_CURR'] == 162297].sort_values('DAYS_CREDIT', ascending=False)
curr_215354 = bureau[bureau['SK_ID_CURR'] == 215354].sort_values('DAYS_CREDIT', ascending=False)

In [65]:
new_bureau= bureau.copy()
new_bureau.loc[new_bureau['SK_ID_CURR'] == 162297, 'PREVIOUS_DAYS_DIFF'] = curr_162297['DAYS_CREDIT']-curr_162297.shift(-1)['DAYS_CREDIT']
new_bureau.loc[bureau['SK_ID_CURR'] == 215354, 'PREVIOUS_DAYS_DIFF'] = curr_215354['DAYS_CREDIT'] - curr_215354.shift(-1)['DAYS_CREDIT']

In [74]:
get_colum_li = ['SK_ID_CURR','SK_ID_BUREAU','DAYS_CREDIT','PREVIOUS_DAYS_DIFF']
id_li =[162297, 215354]
a = new_bureau[get_colum_li].query('SK_ID_CURR == @id_li').fillna(0).sort_values(['SK_ID_CURR', 'DAYS_CREDIT'], ascending=[True, False])
a.index = range(len(a))
a

    SK_ID_CURR  SK_ID_BUREAU  DAYS_CREDIT  PREVIOUS_DAYS_DIFF
0       162297       5714474         -277               869.0
1       162297       5714470        -1146                 0.0
2       162297       5714471        -1146                 0.0
3       162297       5714472        -1146               750.0
4       162297       5714469        -1896               560.0
5       162297       5714473        -2456                 0.0
6       215354       5714468          -43               160.0
7       215354       5714464         -203                 0.0
8       215354       5714465         -203                 5.0
9       215354       5714463         -208                65.0
10      215354       5714467         -273               224.0
11      215354       5714462         -497               132.0
12      215354       5714466         -629               382.0
13      215354       5714461        -1011               322.0
14      215354       5714460        -1333               401.0
15      215354       5714459        -1734               138.0
16      215354       5714458        -1872                 0.0

### 8問

In [17]:
array_8 = df.groupby(['FLAG_OWN_CAR', 'CODE_GENDER']).agg({'AMT_CREDIT': ['mean', 'std']}).reset_index()
array_8

  FLAG_OWN_CAR CODE_GENDER     AMT_CREDIT
                                     mean            std
0            N           F  567929.776823  380808.064188
1            N           M  556830.818128  381202.761174
2            N         XNA  337500.000000   95459.415460
3            Y           F  679769.206677  440545.803389
4            Y           M  652442.822770  428621.732854
5            Y         XNA  461250.000000  111369.318037

In [18]:
array_8.columns = ['CODE_GENDER', 'FLAG_OWN_CAR', 'AMT_CREDIT_mean', 'AMT_CREDIT_std', ]
array_8

  CODE_GENDER FLAG_OWN_CAR  AMT_CREDIT_mean  AMT_CREDIT_std
0           N            F    567929.776823   380808.064188
1           N            M    556830.818128   381202.761174
2           N          XNA    337500.000000    95459.415460
3           Y            F    679769.206677   440545.803389
4           Y            M    652442.822770   428621.732854
5           Y          XNA    461250.000000   111369.318037

### 9問

In [19]:
copy_df = df['NAME_EDUCATION_TYPE'].str.split('/', expand = True)
copy_df.columns = ['category1', 'category2']
copy_df.head()

          category1           category2
0        Secondary    secondary special
1  Higher education                None
2        Secondary    secondary special
3        Secondary    secondary special
4        Secondary    secondary special

### 10問

In [20]:
pd.pivot_table(df, index='TARGET', columns=['NAME_CONTRACT_TYPE', 'CODE_GENDER'], values='AMT_ANNUITY', aggfunc='mean')

NAME_CONTRACT_TYPE    Cash loans               Revolving loans                \
CODE_GENDER                    F             M               F             M
TARGET
0                   27524.909265  29897.304544    15727.203709  18144.192588
1                   26613.873467  28481.125916    12625.239693  13177.139037

NAME_CONTRACT_TYPE
CODE_GENDER              XNA
TARGET
0                   19968.75
1                        NaN